Revit 2024 API
PointLocationOnCurve Members
The PointLocationOnCurve type exposes the following members.
Constructors
Name | Description
PointLocationOnCurve
 Constructs a new instance of a class, with given or default values, to place a point on a curve.
Methods
Name | Description
Dispose
Releases all resources used by the PointLocationOnCurve
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MeasureFrom
 The location on the curve from which the measurement is taken.
MeasurementType
 The measurement type.
MeasurementValue
 The measurement value.
See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace